Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: སྔགས་ཀྱི་ཚིག་འདི་རྣམས་ཆོས་སྨྲ་བ་དེས་ལེགས་པར་ཁ་དོན་དུ་བྱས་ཏེ། ཕྱོགས་བཞིར་བྱམས་པས་ཁྱབ་པར་བྱས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བསམས་ན། སྔགས་ཀྱི་ཚིག་འདི་དག་གིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་བཀུག་ནས་འོང་བར་འགྱུར་རོ། །
en: “When Dharma teachers chant this mantra while spreading love throughout the four directions and bringing the Four Great Kings to mind, the Four Great Kings will be summoned by the mantra.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེ་དག་སྟན་ལས་ལངས་ཏེ།
en: Then the Four Great Kings, who were present in the assembly, rose from their seats.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་བདག་ཅག་ལྷན་ཅིག་ཏུ་འཐུན་པར་གང་ན་ཡང་དག་པ་དང་ལྡན་པའི་རྒྱུད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པར་འགྱུར་བ་དེར། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་ཀུན་ཏུ་སྲུང་བ་དང་ཆོས་སྨྲ་བ་དེ་ཡང་ཡོངས་སུ་གཟུང་བ་དང་། ཅི་ནས་གང་གིས་ཀྱང་མ་བསྒྲིབས་པའམ་གནོད་པར་བགྱིད་པར་མི་འགྱུར་བར་བགྱི་བའི་སླད་དུ་མཆི་བར་བགྱིའོ། །
en: “Blessed One, we, the Four Great Kings, will collectively protect this Dharma teaching and care for its teachers, wherever it is taught with a proper mind, such that they are not obstructed or harmed in any way.”

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགུག་པའི་ཚིག་བརྗོད་པར་བྱ་སྟེ།
en: “Moreover, Sāgaramati, the words that summon Śakra, lord of the gods, must be spoken.

source: ཚིག་དེ་དག་གིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགུག་པར་འགྱུར་རོ། །
en: These words will summon Śakra, lord of the gods.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགུག་པར་འགྱུར་བའི་ཚིག་དེ་དག་གང་ཞེ་ན།
en: What are the words that summon Śakra, lord of the gods?

source: འདི་ལྟ་སྟེ། ཛ་ཡེ། ཛ་ཡ་མ་ཏི། ཨཊྚེ་མཊྚེ་མྃ་ཀུ་རེ། སིདྡྷ་མ་ཏི། ཤུ་བྷེ་ཤཱནྟི་ཀ་རེ། ནད་ནེ། །དཱནྟེ། དཱནྟ་མ་ཏི། ཏ་དྐ་རེ། ཀྵ་ཡེ། ཀྵ་ཡ་མུ་ཁེ། ཨ་བཊྚ་ནི་བི་བཊྚ་ནི་པ་རི་བཊྚ་ནི། པ་རི་ཙྪེ་དེ། སྨྲྀ་ཏི་སྨྲྀ་ཏི་སནྡྷི། ཨཱ་གཙྪ་ཀཽ་ཤི་ཀ །ནིརྫི་ཏཱ། ཨ་སུ་ར། ཛ་ཡནྟི་དེ་བ། ས་མ་ཡ་སྟེ། ཨ་ར་བ་དྷོ། །དྷརྨ་ནི་རྫི་ཏོ། །ར་མ་ཧི། སྭཱ་སྟི་ཡ་ནཱ་མ་བྷུ་ཏཱ་ནཱཾ། ཨ་རཀྵ་དྷརྨ་ཙཱ་རི་ཎཱཾ།
en: They are: jaye jayamati attemattemaṃ­kure siddhamati śubheśānti­kare nadane dānte dāntamati tadkare kṣaye kṣaya­mukhe avttani­vivattanivari­pattani paricchede smṛtismṛti­sandhi āgaccha­kauśika nirjitā asura jayanti­deva samayaste aravadho dharmanijito ramahi svāsti­yanāma­bhutānāṃ arakṣa­dharmacāriṇāṃ.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་དག་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགུག་པའི་ཚིག་སྟེ་དེ་དག་གིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགུག་པར་འགྱུར་རོ། །
en: Sāgaramati, these are the words that summon Śakra, lord of the gods. They will summon Śakra, lord of the gods.

source: དེར་ཆོས་སྨྲ་བ་དེས་སྔགས་ཀྱི་ཚིག་འདི་དག་ལེགས་པར་ཁ་ཏོན་དུ་བྱས་ལ་གཙང་བ་དང་། གཙང་སྦྲའི་ཆོ་གས་ཁྲུས་ལེགས་པར་བྱས་ཏེ། གོས་བཟང་པོ་བགོས་ལ། ཤར་ཕྱོགས་སུ་མེ་ཏོག་གཏོར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་བསམ་པའི་དྲན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་དང་རབ་ཏུ་ལྡན་པས་སེང་གེའི་ཁྲི་ལ་འདུག་སྟེ་
en: “Dharma teachers should chant these mantra syllables and then wash themselves with the cleansing and purifying ritual, wear fine clothes, toss flowers to the east, recollect all the buddhas, have great compassion for all beings, and then take their seat on a lion throne.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བསམས་ལ།
en: Then, considering Śakra, lord of the gods, they should say,

source: ཀཽ་ཤི་ཀ་འཁོར་ལེགས་པར་ཡོངས་སུ་གཞག་པའི་ཕྱིར་ཚུར་ཤོག །
en: ‘Kauśika, please come and strengthen the assembly.

source: སྔགས་ཀྱི་གྲུབ་པ་མངོན་སུམ་དུ་གྱིས་ཤིག་ཅེས་བརྗོད་ན།
en: Enact the fruition of this mantra.’

source: དེའི་བསམ་པ་ཤིན་ཏུ་རྣམ་པར་དག་ཅིང་ཡོངས་སུ་དག་ལ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པས་བསམས་མ་ཐག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འོངས་ནས་འཁོར་ཡོངས་སུ་འཇོག་པར་འགྱུར། སྔགས་ཀྱི་གྲུབ་པ་ཡང་ཉེ་བར་བསྒྲུབ་པར་འགྱུར་རོ། །
en: When they do so, because of the purity of their intention and the purity of their discipline, immediately Śakra will come and enter the assembly and enact the fruition of the mantra.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ། འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Śakra, lord of the gods, who was present in the assembly, pledged to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡོངས་སུ་གཟུང་བ་དང་། ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་བདག་ཆོས་སྨྲ་བ་དེའི་དྲུང་དུ་མཆི་བར་བགྱི།
en: “Blessed One, I will be present near Dharma teachers in order to uphold and preserve this Dharma teaching.

source: དེའི་འཁོར་ཀྱང་ཡོངས་སུ་གཞག་པར་བགྱི།
en: I will strengthen their assembly.

source: སྔགས་ཀྱིས་གྲུབ་པ་ཡང་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ། །
en: I will enact the fruition of this mantra.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བགྱིའོ། །
en: Blessed One, I will extensively and faithfully relay this Dharma teaching to the gods in the Heaven of the Thirty-Three.

source: བཅོམ་ལྡན་འདས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལས་བསྟན་པའི་སླད་དུའོ། །
en: Because it demonstrates the bodhisattva deeds of the blessed buddhas of the past, present, and future.

source: བཅོམ་ལྡན་འདས་བདག་གིས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ལ་གུས་པར་བགྱིས་ཏེཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བགྱིའོ། །
en: Blessed One, I will honor the Dharma of the blessed buddhas of the past, present, and future; thus, I will teach this Dharma teaching extensively and faithfully.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་
en: Then the Blessed One offered his approval to Śakra, lord of the gods:

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: “Kauśika, excellent!

source: ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: It is excellent that you utter the lion’s roar in order to uphold the sublime Dharma.

source: དེ་ལྟ་བུ་ནི་ཁྱོད་ཀྱི་བྱ་བའོ། །
en: That is your task.

source: ལྷའི་དབང་པོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསམས་ན་ལྷ་རྣམས་ནི་རྒྱལ་ཞིང་ལྷ་མ་ཡིན་རྣམས་ནི་ཕམ་པར་འགྱུར་བར་ཤེས་པར་བྱའོ། །
en: Lord of the gods, if you contemplate this Dharma teaching, know that the gods will be victorious, and the asuras will be defeated.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཚར་གཅད་པའི་སྔགས་ཀྱི་ཚིག་འདི་རྣམས་བརྗོད་པར་བྱ་སྟེ།
en: “Moreover, Sāgaramati, the following mantra that destroys the māras and gods of the class of māras must be chanted.

source: སྔགས་ཀྱི་ཚིག་དེ་དག་གིས་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཚར་གཅོད་པར་འགྱུར་རོ། །
en: Thereby, this mantra will destroy the māras and gods of the class of māras.

source: སྔགས་ཀྱི་ཚིག་དེ་དག་གང་ཞེ་ན།
en: What is this mantra?

source: འདི་ལྟ་སྟེ། ཤ་མེ། ཤ་མ་བ་ཏི། ཤ་མི་ཏ་ཤ་ཏྲུ། ཨྃ་ཀུ་རེ། མྃ་ཀུ་རེ། མཱ་ར་ཛི་ཏེ། ཀ་རཱ་ཊེ། ཀེ་ཡཱུ་རེ། ཏེ་ཛོ་བ་ཏི། ཨོ་ཧོ་ཀ་མ་ཏི། བི་ཤ་ཋ། ནི་རྨ་ལེ། མ་ལཱ་པ་ན་ཡེ། ཨོ་ཁ་རེ། ཨོ་ཁ་རཱ། གྲ་སེ། ཁ་ཡཱ་གྲ་སེ། གྲ་ས་ཏེ། ཧེ་མུ་ཁཱི། པ་རཱམུ་ཁི། ཨ་མུ་ཁཱི། ཤ་མི་ཏཱ་ནི། སརྦ་གྲ་ཧ་བནྡྷ་ནཱ་ནི། ནི་གྲྀ་ཧི་ཏྭཱ། སརྦ་པར་པྲ་བཱ་དིན། བི་མུཀྟཱ་མཱ་ར་པ་ཤཱ། སྠཱ་པི་ཏཱ་བུདྡྷ་མུ་དྲཱ། ས་མུངྒྷ་ཏི་ཏཱཿ། སརྦ་མཱ་རཱ། སུ་ཙ་རི་ཏ་པ་ད་པ་རི་ཤུདྡྷྱ། གཙྪནྟུ་སརྦ་མཱ་ར་ཀརྨ་ཎི།
en: It is: śame śamavati śamitaśatru oṃkure maṃkure mārajite karāṭe keyūre tejovati ohokamati viśaṭha nirmale malāvanaye okhare okharā grase khayāgrase grasate hemukhī parāmukhi amukhī śamitāni sarva­graha­vandhanāni nigraṃhitā sarva­parapravādina vimuktā­māra­pāśā sthāpitā­buddha­mudrā samud­ghatitāh sarva­mārā sucarita­pada­pariśuddhya gacchantu­sarva­māra­karmaṇi.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་དག་ནི་བདུད་ཚར་གཅད་པའི་ཚིག །ཉོན་མོངས་པ་བསལ་བའི་ཚིག་སྟེ།
en: “Sāgaramati, these syllables destroy māras and eliminate afflictions.

source: དེ་དག་ཆོས་སྨྲ་བ་དེས་ལེགས་པར་ཁ་ཏོན་དུ་བྱས་ལ་ཆོས་ཀྱི་ཁྲི་ལ་འདུག་སྟེ། བྱང་ཆུབ་ཀྱི་རྣམ་པས་མངོན་པར་བསྒྲུབས་པའི་བྱམས་པས་འཁོར་ཐམས་ཅད་ལ་ཁྱབ་པར་བྱས་ལ། བདག་ལ་སྨན་པར་འདུ་ཤེས་བསྐྱེད་དེ། ཆོས་ལ་སྨན་གྱི་འདུ་ཤེས་དང་། ཆོས་ཉན་པ་ལ་ནད་པའི་འདུ་ཤེས་དང་། དེ་བཞིན་གཤེགས་པ་ལ་སྐྱེས་བུ་དམ་པའི་འདུ་ཤེས་དང་། ཆོས་ཀྱི་ཚུལ་ལ་ཡུན་རིང་དུ་གནས་པའི་འདུ་ཤེས་བསྐྱེད་ལ།
en: Dharma teachers should chant these syllables while seated on a Dharma throne, pervading the entire assembly with a love that is formed by awakening, and while arousing the notion of themselves as physicians, the Dharma as medicine, the Dharma audience as patients, the Thus-Gone One as a sublime being, and the way of the Dharma as something that persists.

source: སྔགས་ཀྱི་ཚིག་འདི་དག་མངོན་དུ་བྱས་ཏེཆོས་ཀྱི་གཏམ་བྱེད་ན། དེའི་ཁོར་ཡུག་དཔག་ཚད་བརྒྱ་ཚུན་ཆད་དུ་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་མིག་གིས་མི་རྩོལ་བར་བྱ་བའི་ལས་ཀྱི་ཕྱིར་འོང་བར་མི་འགྱུར་རོ། །
en: When they bring forth this mantra and teach the Dharma, no māra or god of the class of māra will be able to come within a hundred leagues to cause confusion.

source: གང་དག་འོང་བ་དེ་དག་ཀྱང་བར་ཆད་བྱེད་པར་མི་ནུས་སོ། །
en: Even if they do come near, they will be unable to cause obstacles.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བདུད་སྡིག་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The evil māras then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་བདག་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་འཇིག་རྟེན་གྱི་ཁམས། བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་འཕངས་པ་སྐྱེས་བུ་དམ་པ་དེ་དག་གིས་བྱིན་གྱི་རླབས་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་འདི་བདག་ལ་མངོན་སུམ་དུ་གྱུར་ཏོ། །
en: “Blessed One, when the bodhisattva Sāgaramati sent us to the world Adorned with Every Pleasure, the sublime beings there manifested their blessings, magic, and miracles for us.

source: བཅོམ་ལྡན་འདས་བདག་དེང་སླན་ཆད་བདུད་ཀྱི་སུག་ལས་ཐམས་ཅད་འདོར་རོ། །
en: Blessed One, from this day hence we will spurn all the works of Māra.

source: གང་དག་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་བའི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། གཙུག་ལག་ཁང་དེར་ཆོས་མཉན་པའི་སླད་དུ་
en: We will be present wherever this Dharma teaching is given—in any town, village, city, or temple where it is taught.

source: བདག་ང་རྒྱལ་མ་མཆིས་པ་དང་། གུས་པ་དང་བཅས་ཤིང་ཞེ་ས་དང་བཅས་པས་མཆིས་པར་བགྱིའོ། །
en: We will be humble, respectful, and deferential to receive it.”

source: སྡིག་ཅན་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent, evil ones.

source: ཁྱོད་ཆོས་ལ་གུས་པའི་རྣམ་པར་སྨིན་པ་འདིས་རིམ་གྱིས་བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་ཏེ།
en: As this respect for the Dharma ripens, you will gradually give up all the works of Māra.

source: གང་སྐྱེས་བུ་དམ་པ་དེ་དག་གིས་ཐོབ་པའི་ཆོས་དེ་དག་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། །
en: You will attain the same Dharma that these sublime beings attain.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དགུག་པའི་སྔགས་ཀྱི་ཚིག་རྣམས་བརྗོད་པར་བྱ་སྟེ།
en: “Moreover, Sāgaramati, the mantra that summons Brahmā, master of the Sahā world, must be spoken.

source: དགུག་པའི་སྔགས་ཀྱི་ཚིག་དེ་དག་གིས་ཚངས་པ་བཀུག་ནས་ཆོས་སྨྲ་བའི་གན་དུ་འོང་བར་འགྱུར་རོ། །
en: Once Brahmā has been summoned with this summoning mantra, he will come before Dharma teachers.

source: འདི་ལྟ་སྟེ། མཻ་ཏྲེ་ཀ་རེ། ཀ་རུ་ཎ་ཀ་རེ། མུ་དི་ཏ་ཀ་རེ། ཨུ་པེ་ཀྵ་ཀ་རེ། བུདྡྷ་ཀ་རེ། དྷརྨ་ཀ་རེ། སཾ་གྷ་ཀ་རེ། སུ་ཀྲྀ་ཏ་བི་ཛ་ཡེ། མ་ཧཱ་བི་ཏཱ་ནེ། ནི་སྥ་རེ། དཱ་གྷེ། ཨོ་ཛོ་བ་ཏི། ཨོ་ཛོ་ག་མེ། དྷརྨཱ་ན། ནད་ནེ། ས་ཏྱ་པྲ་ཏིཥྛཱ་ནེ། ཨུ་པ་པ་ཏི། བི་ཤུ་དྡྷེ། སྭ་ཙིཏྟ་ཨུ་པ་ཤ་མེ། བྱ་བ་ལོ་ཀ་ཡ་བྲ་ཧྨ་ཎ། བྱུ་ཏིཥྛ་ནམ་སྟེ། ཨ་བེ་ཀྵ། སྭ་དྷརྨ་ཙ་ར་ཎཱྃ། ཀུ་རུ་སདྡྷརྨ་པ་རི་གྲཱ་ཧ་ཎ། ཀྲི་ཏ་མ་ནུ་བཱ་ལ་ཡ། བུདྡྷ་ནེ། ཏྲཱི་མ་མ་བྱ་བ་ཙྪེ། བ་སི། སྨ་ར་ཏ། དྷརྨ་ཙཀྲ་པྲ་བནྟཱ་ནཱྃ།། ཀུ་རུ་ས་ཏྭ་བི་ཤོ་དྷ་ནཱྃ། པྲ་ཏི་གྲྀ་ཧཱ་ན། དྷརྨཱ་ནཱ་ག་ར་མཱ་ལཱ་ནཱྃ། བུདྡྷ་ཨ་དྷིཥྛཱ་ནཱྃ། མཱ་བི་ཀ་ཨུ་པ་ཡ།
en: It is: maitrekare karuṇakare mudita­kare upekṣa­kare buddhakare dharma­kare saṅgha­kare sukrītavijaye mahāvitāne nisphare dāghe ojovati ojogame dharmāna nadane satya­pratiṣṭāne upapati viśuddhe svacitta upaśame vyavalokaya­brahmāṇa vyutiṣṭha­namaste apekṣa svadharma­caraṇāṃ kurusa­dharma­parigrāhaṇa kritamanu­vālaya buddhane trīmama­vyavacche vasi smarata dharma­cakra­pravartānāṃ kurusatva­viśodhanā pratigrīhāna dharmā­nāgaramālānāṃ māvikaupaya.

source: བློ་གྲོས་རྒྱ་མཚོ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དགུག་པའི་ཚིག་འདི་དག་ཆོས་སྨྲ་བ་དེས་ལེགས་པར་ཁ་ཏོན་དུ་བྱས་ལ་ཚངས་པའི་ལམ་ལ་ཤིན་ཏུ་གནས་ཏེཞེ་འགྲས་པ་མེད་པའི། སེམས་ཀྱི་རྒྱུད་དང་། དབང་པོ་ཤིན་ཏུ་སྦས་པ་དང་། ཤིན་ཏུ་བསྲུངས་པའི་དྲན་པ་དང་། ཤིན་ཏུ་དཀར་བའི་ཕྱག་རྒྱ་དང་། ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ལུས་ཀྱི་ལས་དང་། ཤིན་ཏུ་དབེན་པས་ཟིན་པའི་ངག་གི་ལས་དང་། ཤིན་ཏུ་བརྟན་པའི་བློ་དང་། ལེགས་པར་བྱས་པའི་བཟོད་པའི་ལས་དང་། ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ལེགས་པར་བརྩམས་པའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། ཤིན་ཏུ་བསྟེན་པའི་མང་དུ་ཐོས་པ་དང་། ཤིན་ཏུ་ཡོངས་སུ་བསྒོམས་པའི་སེམས་ལས་སུ་རུང་བ་དང་། ཤིན་ཏུ་རྣོ་བའི་ཤེས་རབ་ཀྱི་དབང་པོ་དང་། ཤིན་ཏུ་བརྩོན་པའི་ཡང་དག་པའི་སྦྱོར་བ་དང་།
en: “Sāgaramati, Dharma teachers should chant these words that summon Brahmā, master of the Sahā world, live a pure life, and have non-aggressive minds, calm faculties, guarded mindfulness, a pure seal, pure physical actions, isolated verbal actions, stable minds, good patient deeds, refined discipline, well-applied diligence, reliable learning, cultivated mental pliancy, sharp faculties of insight, and diligent proper engagement.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ལེགས་པར་ཟིན་པ་དང་། ཤིན་ཏུ་ཡོངས་སུ་བསྒོམས་པའི་བྱམས་པ་དང་། ཤིན་ཏུ་བརྟན་པའི་སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་ཡང་དག་པར་སྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་ཤིན་ཏུ་ཡོངས་སུ་དགྲོལ་བའི་ཕྱིར་སེང་གེའི་ཁྲི་ལ་འདུག་སྟེ
en: They should retain the mind of awakening, have fully cultivated love, arouse joy in all beings through their stable great compassion, sit on the lion throne in order to liberate all beings from suffering, and deliver Dharma discourses while remembering Brahmā, master of the Sahā world.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བསམས་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་རབ་ཏུ་བརྗོད་ན། དེས་བསམས་མ་ཐག་ཏུ་ཚངས་པ་ཚངས་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་ཏུ་འོང་བར་འགྱུར་རོ། །
en: Then, as soon as they bring him to mind, Brahmā and his Brahmā gods will arrive.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཚངས་པ་འོང་བར་འགྱུར་བའི་ལྟས་ནི་འདི་ལྟ་བུ་འདི་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: “Sāgaramati, the following things will happen when Brahmā is seen arriving:

source: འདི་ལྟ་སྟེ། འཁོར་ཐམས་ཅད་བྱམས་པའི་སེམས་སུ་འགྱུར་བ་དང་། དབང་པོ་ཉམས་པ་མེད་པ་དང་། གཅིག་ལ་གཅིག་མི་གནོད་པར་གནས་པ་དང་།
en: the entire assembly will change to having a loving mind, their faculties will not decline, they will not harm one another,

source: ཆོས་དང་ཆོས་སྨྲ་བ་ལ་སྟོན་པ་དང་། བླ་མ་ལྟར་ཕངས་པར་སེམས་པ་དང་། ཐལ་མོ་སྦྱར་བ་དང་སེམས་རྩེ་གཅིག་པ་དང་། མི་གཡེང་བར་ཡིད་ལ་བྱེད་པ་དང་། རུས་ཤིང་ལྟར་བྱེད་པ་དང་། ཡིད་ལ་བྱེད་པ་དང་། སེམས་ཐམས་ཅད་ཀྱིས་སེམས་པ་དང་རྣ་བ་བླགས་ཏེ་ཉན་པ་དང་། ཆོས་སྨྲ་བ་དེ་ཡང་སྔོན་ལུང་མ་མནོས་པ་དང་། སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ཀྱང་མངོན་དུ་འགྱུར་བ་སྟེ།
en: they will esteem the Dharma and Dharma teachers as teachers and masters, they will join their palms, their minds will be one-pointed, they will be mentally engaged without distraction, they will act with perseverance, they will be mentally engaged, and with their whole minds they will be conscientious and attentively listening.

source: འཁོར་དེར་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་འོངས་པར་རིག་པར་བྱའོ། །
en: These Dharma teachers will attain the scriptures they had not previously received and the teachings they had not previously heard.

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས།
en: Know that it is into their assembly that Brahmā, master of the Sahā world, will come.”

source: བཅོམ་ལྡན་འདས་བདག་ཚངས་པའི་འཇིག་རྟེན་དུ་གནས་ཏེ།
en: “Blessed One, I live in the Brahmā world.

source: བསམ་གཏན་དང་ཚད་མེད་པའི་བདེ་བ་ལ་གནས་པ་བོར་ལ་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པའི་འཁོར་དེར་མཆི་བར་བགྱིའོ། །
en: However, I will give up its concentrations and limitless bliss states to be present in the assemblies where this Dharma teaching is given.

source: ཆོས་སྨྲ་བ་དེ་ལ་ཡང་ཆོས་བརྒྱད་བསྒྲུབ་པར་བགྱིའོ། །
en: Such Dharma teachers will accomplish eight qualities.

source: བརྒྱད་གང་ཞེ་ན། ཇི་ལྟར་ཐོས་པའི་ཆོས་མི་བསྐྱུད་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་དྲན་པ་བསྒྲུབ་པར་བགྱི།
en: What are they? (1) They will accomplish mindfulness in order to not forget the teachings they have heard.

source: ཆོས་ཟབ་མོ་རྟོགས་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་བློ་གྲོས་བསྒྲུབ་པར་བགྱི།
en: (2) They will accomplish intelligence in order to realize the profound Dharma.

source: དོན་གྱི་རྣམ་པར་རྟོགས་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་རྟོགས་པ་བསྒྲུབ་པར་བགྱི།
en: (3) They will accomplish realization in order to fully comprehend the meaning.

source: ཐེ་ཚོམ་ཐམས་ཅད་གཅད་པའི་སླད་དུ་དེ་ལ་སྤོབས་པ་བསྒྲུབ་པར་བགྱི།
en: (4) They will accomplish eloquence in order to cut through all doubt.

source: སྐད་དང་ངེས་པའི་ཚིག་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་ལུང་བསྟན་པ་ཕུན་སུམ་ཚོགས་པ་བསྒྲུབ་པར་བགྱི།
en: (5) They will accomplish perfect teachings in order to satisfy with all manner of languages and explanations.

source: འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་མི་ནོན་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་འདུལ་བ་བསྲུང་བ་བསྒྲུབ་པར་བགྱི།
en: (6) They will accomplish the guarding of the vinaya in order to outshine the entire assembly.

source: མི་དམན་པར་ལུང་བསྟན་པར་བྱ་བའི་སླད་དུ་དེ་ལ་ཆོས་ཀྱི་སྣང་བ་བསྒྲུབ་པར་བགྱི།
en: (7) They will accomplish the light of Dharma in order to teach inferior beings.

source: དེ་བགྱིད་ཅིང་ཆོས་བསྒྲུབ་པའི་སླད་དུ་དེ་ལ་ངེས་པར་འབྱུང་བའི་སྒོ་བསྒྲུབ་པར་བགྱི་སྟེ།
en: (8) They will accomplish the gateway of emancipation in order to engage in all of this and to accomplish the Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་སྨྲ་བ་དེ་ལ་ཆོས་བརྒྱད་པོ་འདི་དག་བསྒྲུབ་པར་བགྱིའོ། །
en: Blessed One, such Dharma teachers will accomplish these eight qualities.

source: ཆོས་སྨྲ་བ་དེ་ལ་བསྲུང་ཞིང་སྦ་བ་དང་། དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཇི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱས་པར་འགྱུར་བ་དེ་ལྟར་བདུད་ཐམས་ཅད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཤིན་ཏུ་ཚར་གཅད་པར་བགྱིའོ། །
en: So that these Dharma teachers may be guarded and protected, and so that the sublime Dharma may remain for a long time, through the blessings of the Thus-Gone One, I will ensure that as this Dharma teaching is spread, all māras and obstructers will be destroyed.”

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། ཐ་མའི་དུས་ཀྱི་ཚེ་ཅི་ནས་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སུག་པར་མཆི་བ་དང་། མཛོད་དུ་ཆུད་པ་དང་། གླེགས་བམ་དུ་འགྱུར་ཞིང་ནུབ་པར་མི་འགྱུར་བར་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: “Blessed One, please grant your blessings so that in the final age after the Thus-gone One has passed into complete nirvāṇa, this Dharma teaching will reach the hands of beings who have formed roots of virtue, be placed in treasuries, put into writing, and not fade.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་གསོལ་བ་བཏབ་པ་མཁྱེན་ནས། མཛོད་སྤུ་ནས་འདི་ལྟ་བུའི་འོད་ཕྱུང་སྟེ། འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོ་ཁྱབ་པར་གྱུར་ནས།
en: The Blessed One understood the bodhisattva Sāgaramati’s request and sent forth a burst of light from his ūrṇa hair that filled the worlds of the great trichiliocosm with a brilliant glow.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དང་། རྡོ་དང་གྱོ་མོ་དང་གཟུགས་སུ་སྣང་བ་གང་དག་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་གཟུགས་སུ་སྣང་ངོ་། །
en: This caused all the grasses, trees, herbs, forests, stones, pebbles, and everything else in the worlds of the great trichiliocosm to appear in the form of the Thus-Gone One.

source: རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ན་མཆོད་པའི་ལས་བྱིན་གྱིས་བརླབས་པའི་གཟུགས་ཀྱི་རྣམ་པ་གང་དག་ཡོད་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཉིད་དུ་གནས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: In the jeweled pavilion, all the appearances that had been blessed as offerings also appeared in the form of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་དེ་དག་གིས་གསུང་གཅིག་ཏུ།
en: All these forms of the Thus-Gone One then proclaimed in unity,

source: ཀྱེ་མའོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བྱིན་གྱིས་བརླབས་སོ། །
en: “Hark! This Dharma teaching is blessed by the blessed Śākyamuni.

source: གང་བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའོ། །
en: Anything that is blessed by a blessed one is blessed by all blessed ones.

source: གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དེ་ལ་བདུད་ཐམས་ཅད་ཀྱིས་བར་ཆད་བྱ་བར་མི་ནུས་སོ། །
en: Anything that is blessed by all blessed ones cannot be obstructed by māras.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བདུད་དཔུང་དང་བཅས། གཡོག་འཁོར་དང་བཅས་ཏེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བར་ཆད་བྱ་བར་བརྟུན་ཀྱང་དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བར་ཆད་བྱ་བར་མི་ནུས་སོ། །
en: Even if māras, their supporters, and their servants as numerous as the grains of sand in the Ganges were to try to obstruct it, they could not obstruct this Dharma teaching.

source: ས་ནི་འགས་ཀྱང་སྲིད། རྒྱ་མཚོ་ཐམས་ཅད་ནི་སྐམ་ཡང་སྲིད། རི་ཐམས་ཅད་ནི་རྣམ་པར་འཐོར་ཡང་སྲིད། རླུང་ནི་ཞགས་པས་བཅིང་དུ་རུང་ཡང་སྲིད། ཉི་མ་དང་ཟླ་བ་ནི་སའི་སྟེང་དུ་ལྟུང་ཡང་སྲིད། ནམ་མཁའ་ནི་གཟུགས་ཀྱི་རྣམ་པར་བསྟན་དུ་རུང་ཡང་སྲིད། མེ་ནི་ཆུར་འགྱུར་ཡང་སྲིད། ཆུ་ནི་མེར་འགྱུར་ཡང་སྲིད། འབྱུང་བ་ཆེན་པོ་བཞི་ནི་གཞན་དུ་འགྱུར་ཡང་སྲིད། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ནི་གཅིག་ཏུ་བྱར་རུང་ཡང་སྲིད། ནམ་མཁའ་དང་ས་ནི་འབྱར་ཡང་སྲིད་ཀྱི། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ནི་སུས་ཀྱང་བསྐྱོད་པ་འམ་གཡོ་བ་འམ་འཁྲུགས་པར་བྱེད་མི་ནུས་སོ་ཞེས་གསུངས་སོ། །
en: It is possible that the earth could crack open, that the oceans could evaporate, that the mountains could crumble, that the wind could be captured, that the sun and moon could plummet to the earth, that space could show itself as form, that fire could become water, that water could become fire, that the four elements could transform into other elements, that the minds of all beings could function as one, and that the earth and sky could get stuck together—yet, it is impossible that the blessings of the thus-gone ones could be agitated, shaken, or disturbed by anyone.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་སྤྱི་བོར་ཕྱག་བཞག་སྟེ།
en: Then the Blessed One placed his hand upon Venerable Ānanda’s crown, saying to him,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Ānanda, you must uphold the sacred Dharma to ensure it will last a long time.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བྱ་བ་ཉེ་བར་བཟུང་སྟེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །
en: You must uphold this Dharma teaching and keep it, recite it, master it, and teach it broadly and genuinely to others!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དོན་གྱི་དབང་གང་གཟིགས་ནས་དེ་ལ་རྒྱ་མཚོ་དང་མཚོ་ཆེན་པོ་ལྟར། གཏིང་དཔག་དཀའ་བའི་དྲན་པ་དང་བློ་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་མཆིས་བཞིན་དུ། དགེ་སློང་ཀུན་དགའ་བོ་ཉི་ཚེ་བའི་འཚལ་བ་དང་ལྡན་པ་ལ་ཆོས་ཀྱི་ལེའུ་འདི་ལྟ་བུ་འདི་ཡོངས་སུ་གཏད།
en: “When there are bodhisattvas here who have attained the mindfulness and intellect of the truth seen by the Blessed One, which is as difficult to fathom as the ocean or a great sea, why is the monk Ānanda, with his partial understanding, to be entrusted with this Dharma teaching?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་དགེ་སློང་ཀུན་དགའ་བོ་རང་གི་བློའི་སྟོབས་བསྐྱེད་པས་མདོ་སྡེ་འདི་ལྟ་བུ་འཛིན་པ་མ་ཡིན་གྱི།
en: “Sāgaramati,” responded the Blessed One, “the monk Ānanda will not uphold this sūtra by arousing his own strength of intellect.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འཛིན་ཏོ། །
en: He will uphold it through the Thus-Gone One’s blessings.

source: བློ་གྲོས་རྒྱ་མཚོ་སེམས་ཅན་གང་དག་དགེ་སློང་ཀུན་དགའ་བོ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ན་དགའ་བ་དང་། དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་ཐོབ་པར་འགྱུར་བ་ཡོད་དེ།
en: Sāgaramati, any being who hears this Dharma teaching from the monk Ānanda will be gladdened, and attain faith and supreme joy.

source: དེ་དག་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ།
en: It will occur to them,

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འདི་ལྟར་ཉན་ཐོས་ཀྱང་འདི་ལྟ་བུའི་མདོ་སྡེ་འདི་འཛིན་ཅིང་སྟོན་པ་ནི། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཅི་ཙམ་དུ་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་ཏོ་སྙམ་དུ་སེམས་པར་འགྱུར་རོ། །
en: ‘It is through the Thus-Gone One’s blessings that this hearer is upholding and teaching this sūtra; such are the unfathomable and incredible blessings of the Thus-Gone One.’ ”

source: དེ་ནས་འཁོར་དེ་ལས་ལྷ་དང་མི་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then some of the gods and men in the assembly thought,

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་འདི་དྲན་པ་དང་རབ་ཏུ་ལྡན་པ་ཡིན་གྱི། གང་བཅོམ་ལྡན་འདས་ཀྱིས་མང་དུ་ཐོས་པའི་མཆོག་ཏུ་བསྟན་པའི་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནི་དེ་ལྟ་མ་ཡིན་ནོ་སྙམ་མོ། །
en: “How is it that the bodhisattva Sāgaramati is endowed with this degree of mindfulness while Venerable Ānanda, who is the most knowledgeable of all those taught by the Thus-Gone One, is not?”
